USE Test
GO
/*************************************************************************************************
 로그인 생성
**************************************************************************************************/
CREATE LOGIN STest WITH PASSWORD = N'STest12', DEFAULT_DATABASE = Test
GO
ALTER SERVER ROLE sysadmin ADD MEMBER STest
GO

/*************************************************************************************************
 사용자 추가
**************************************************************************************************/
CREATE USER STest FOR LOGIN STest
GO
ALTER USER STest WITH DEFAULT_SCHEMA = dbo
GO
ALTER ROLE db_owner ADD MEMBER STest
GO
/*************************************************************************************************
 로그인 및 사용자 삭제
**************************************************************************************************/
DROP LOGIN STest
DROP USER STest

/*************************************************************************************************
 참조사이트
 https://blog.sqlauthority.com/2018/05/16/sql-server-simple-script-to-create-a-login-and-user-for-a-specific-database-with-system-admin-rights/
**************************************************************************************************/
